# GetAllDownstreamLoadIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalAnalyticalNode..::..GetAllDownstreamLoadIds Method
ElectricalAnalyticalNode Class See Also
---
Get all the descendant Electrical Analytical Load ids of the node.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public ISet<ElementId> GetAllDownstreamLoadIds()
```

Visual Basic
---
```text
Public Function GetAllDownstreamLoadIds As ISet(Of ElementId)
```

Visual C++
---
```text
public:
ISet<ElementId^>^ GetAllDownstreamLoadIds()
```

# Remarks
No matter the load is on stand by or not, the load id will be included in the returned load ids set.
# See Also
ElectricalAnalyticalNode Class
Autodesk.Revit.DB.Electrical Namespace